src/InformationRegisters/ДанныеМультимедиа/ДанныеМультимедиа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеМультимедиа</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипДанных</name>
    <type>
      <types>EnumRef.ТипХранимыхДанных</types>
    </type>
  </resources>
  <resources>
    <name>РазмерДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>UID</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ДанныеМультимедиа/ManagerModule.bsl
Функция ПолучитьДанныеФото(ТоварСсылка, UIDкартинкиТовара) Экспорт 
	Рег = РегистрыСведений.ДанныеМультимедиа.СоздатьНаборЗаписей();
	Рег.Отбор.Товар.Установить(ТоварСсылка);
	Рег.Отбор.UID.Установить(UIDкартинкиТовара);
	Рег.Прочитать();
	Если Рег.Количество() = 0 Тогда Возврат Неопределено КонецЕсли;
	ДДФайла = Рег[0].Данные.Получить();	
	
	Возврат ДДФайла;
КонецФункции

Процедура УдалитьФото(ТоварСсылка, UIDкартинкиТовара) Экспорт 
	НаборЗаписей = РегистрыСведений.ДанныеМультимедиа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Товар.Установить(ТоварСсылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры
